package accounting_project;

public class Company {
    public static void main(String[] args) {


        /*Тех задание:
        Молодому рекламному агентству нужна новая бухгалтерская программа.
        У заказчика следующие требования. Программа должна уметь:
        -добавлять сотрудников в штат
        -удалять сотрудников из штата
        -рассчитывать зарплату для двух категорий сотрудников:
            сотрудника с почасовой оплатой и менеджера по продажам
        -выводить на экран список сотрудников
        -суммировать зарплату всех сотрудников
        -у сотрудника на почасовой оплате должно быть поле ставка за час. Метод расчета его зарплаты должен
            учитывать минимальный размер оплаты труда
        -у менеджера по продажам нет фиксированной оплаты, его зарплата рассчитывается как процент от обьема продаж
            . Но в его случае также должен учитываься минимальный размер оплаты труда*/

        /*Руководство по разработке программ:

ШАГ1: Постановка задачи:
- Что будем вводить? Что на входе? -  данные сотрудника
- Какие данные на входе? - зарплаты
- Что надо сделать? - ответ
- Что будет на выходе из программы? - ответ
- Ключевой алгоритм? - записать алгоритм
- Какой будет интерфейс взаимодействия с пользователем? - описать

ШАГ 2: Написание кода:
- импорт необходимых компонент;
- подсказки по синтаксису языка;
- похожие примеры кода...

ШАГ 3: Запуск и отладка
    - устраняем ошибки синтаксиса...

ШАГ 4: Тестирование на разных наборах данных и на все случаи по логики

Шаг 5: Можно "продавать продукт" ;-)
*/
    }
}
